bouffalolab/bl_iot_sdk/components/platform/hosal/bl602_hal/bl_sec_aes.c
    Sec_Eng_AES_Link_Work(aesId, (uint32_t)&linkCfg, &(aesSrcBuf_data[0]), 32, aesDstBuf);
    Aes_Compare_Data(aesResult_entrypted_ctr_128, (uint8_t*)linkCfg.aesDstAddr, 32);

    blog_info("[CTR] IV Status After %08lx\r\n", linkCfg.aesSrcAddr);
    _dump_iv_status(&linkCfg);
    
    Sec_Eng_AES_Link_Work(aesId, (uint32_t)&linkCfg, &(aesSrcBuf_data[0]) + 32, 16, aesDstBuf);
    Aes_Compare_Data(&(aesResult_entrypted_ctr_128[0]) + 32, (uint8_t*)linkCfg.aesDstAddr, 16);
    blog_info("[CTR] IV Status After %08lx\r\n", linkCfg.aesSrcAddr);
    _dump_iv_status(&linkCfg);
    
    Sec_Eng_AES_Link_Work(aesId, (uint32_t)&linkCfg, &(aesSrcBuf_data[0]) + 48, 16, aesDstBuf);
    Aes_Compare_Data(&(aesResult_entrypted_ctr_128[0]) + 48, (uint8_t*)linkCfg.aesDstAddr, 16);
    blog_info("[CTR] IV Status After, %08lx\r\n", linkCfg.aesSrcAddr);
    _dump_iv_status(&linkCfg);

    Sec_Eng_AES_Disable_Link(aesId);
}

void Sec_Eng_AES_Link_Case_ECB_128(SEC_ENG_AES_ID_Type aesId)
{
    uint8_t aesDstBuf[32];
    static const uint8_t aesResult_entrypted_ecb_128[] =
    {
        0x3a, 0xd7, 0x7b, 0xb4, 0x0d, 0x7a, 0x36, 0x60, 0xa8, 0x9e, 0xca, 0xf3, 0x24, 0x66, 0xef, 0x97,
        0x3a, 0xd7, 0x7b, 0xb4, 0x0d, 0x7a, 0x36, 0x60, 0xa8, 0x9e, 0xca, 0xf3, 0x24, 0x66, 0xef, 0x97,
        0x3a, 0xd7, 0x7b, 0xb4, 0x0d, 0x7a, 0x36, 0x60, 0xa8, 0x9e, 0xca, 0xf3, 0x24, 0x66, 0xef, 0x97,
        0x3a, 0xd7, 0x7b, 0xb4, 0x0d, 0x7a, 0x36, 0x60, 0xa8, 0x9e, 0xca, 0xf3, 0x24, 0x66, 0xef, 0x97,
    };
    SEC_Eng_AES_Link_Config_Type linkCfg = {
        .aesMode = SEC_ENG_AES_KEY_128BITS,                            /* 128-bit key mode select */
        .aesDecEn = SEC_ENG_AES_ENCRYPTION,                            /* Encode */
        .aesDecKeySel = SEC_ENG_AES_USE_NEW,                           /* Use new key */
        .aesIntClr = 0,                                                /* Not clear intrrupt */
        .aesIntSet = 1,                                                /* Not set interrupt */
        .aesBlockMode = SEC_ENG_AES_ECB,                               /* CTR mode select */
        .aesIVSel = SEC_ENG_AES_USE_NEW,                               /* Use new iv */
        .aesMsgLen = 1,                                                /* Number of 128-bit block */
        .aesSrcAddr = 0,                                               /* Message source address */
        .aesDstAddr = 0,                                               /* Message destination address */
        .aesIV0 = 0xf3f2f1f0,                                          /* Big endian initial vector(MSB) */
        .aesIV1 = 0xf7f6f5f4,                                          /* Big endian initial vector */
        .aesIV2 = 0xfbfaf9f8,                                          /* Big endian initial vector */
        .aesIV3 = 0xfffefdfc,                                          /* Big endian initial vector(LSB)(CTR mode:counter initial value) */
        .aesKey0 = 0x16157e2b,                                         /* Big endian aes key(aes-128/256 key MSB) */
        .aesKey1 = 0xa6d2ae28,                                         /* Big endian aes key */
        .aesKey2 = 0x8815f7ab,                                         /* Big endian aes key */
        .aesKey3 = 0x3c4fcf09,                                         /* Big endian aes key(aes-128 key LSB) */
        .aesKey4 = 0,                                                  /* Big endian aes key */
        .aesKey5 = 0,                                                  /* Big endian aes key */
        .aesKey6 = 0,                                                  /* Big endian aes key */
        .aesKey7 = 0                                                   /* Big endian aes key(aes-256 key LSB) */
    };

    puts("[ECB] AES-128-ECB case...\r\n");

    Sec_Eng_AES_Enable_Link(aesId);

    Sec_Eng_AES_Link_Work(aesId, (uint32_t)&linkCfg, &(aesSrcBuf_data[0]), 32, aesDstBuf);
    Aes_Compare_Data(aesResult_entrypted_ecb_128, (uint8_t*)linkCfg.aesDstAddr, 32);
    
    Sec_Eng_AES_Link_Work(aesId, (uint32_t)&linkCfg, &(aesSrcBuf_data[0]) + 32, 16, aesDstBuf);
    Aes_Compare_Data(&(aesResult_entrypted_ecb_128[0]) + 32, (uint8_t*)linkCfg.aesDstAddr, 16);
    
    Sec_Eng_AES_Link_Work(aesId, (uint32_t)&linkCfg, &(aesSrcBuf_data[0]) + 48, 16, aesDstBuf);
    Aes_Compare_Data(&(aesResult_entrypted_ecb_128[0]) + 48, (uint8_t*)linkCfg.aesDstAddr, 16);

    Sec_Eng_AES_Disable_Link(aesId);
}

int bl_sec_aes_test(void)
{
    bl_irq_register(SEC_AES_IRQn, bl_sec_aes_IRQHandler);
    bl_irq_enable(SEC_AES_IRQn);
    blog_print("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n");
    Sec_Eng_AES_Link_Case_CBC_128(SEC_ENG_AES_ID0);
    blog_print("####################################################################################\r\n");
    Sec_Eng_AES_Link_Case_CTR_128(SEC_ENG_AES_ID0);
    blog_print("####################################################################################\r\n");
    Sec_Eng_AES_Link_Case_ECB_128(SEC_ENG_AES_ID0);
    blog_print("------------------------------------------------------------------------------------\r\n");
    return 0;
}


static void _clear_aes_int()
{
    uint32_t AESx = SEC_ENG_BASE;
    uint32_t val;

    val = BL_RD_REG(AESx, SEC_ENG_SE_AES_0_CTRL);
    val = BL_SET_REG_BIT(val, SEC_ENG_SE_AES_0_INT_CLR_1T);
    BL_WR_REG(AESx, SEC_ENG_SE_AES_0_CTRL, val);
}

void bl_sec_aes_IRQHandler(void)
{
    blog_print("--->>> AES IRQ\r\n");
    _clear_aes_int();
}

static SEC_ENG_AES_Key_Type get_key_type(uint32_t keybits)
{
    switch(keybits)
    {
        case 24:
            return SEC_ENG_AES_KEY_192BITS;
        case 32:
            return SEC_ENG_AES_KEY_256BITS;
        default:
            return SEC_ENG_AES_KEY_128BITS;
    }
}

static int get_cbc_mac_input(size_t length,
                           const unsigned char *iv, size_t iv_len,
                           const unsigned char *add, size_t add_len,
                           const unsigned char *input, size_t tag_len,
                           unsigned char *b_input)
{
    int ret = -1;
    unsigned char i;
    unsigned char q;
    size_t len_left;
    unsigned char b[16];
    const unsigned char *src;
    unsigned int  cbc_adata_round = 0;
    unsigned int  cbc_pt_round = 0;

    if( tag_len == 2 || tag_len > 16 || tag_len % 2 != 0 )
        return(ret);

    /* Also implies q is within bounds */
    if( iv_len < 7 || iv_len > 13 )
        return(ret);

