bouffalolab/bl_iot_sdk/components/platform/hosal/bl602_hal/bl_sec_aes.c
	if(!b_output)
	{
	    ret = -1;
	    goto exit;
	}

	BL602_MemSet(b_input, 0, b_input_size);
	BL602_MemSet(b_output, 0, b_output_size);
	
	ret = get_cbc_mac_input(length, iv, iv_len, add, add_len, input, tag_len, b_input);

	if(ret)
	{
	    ret = -1;
		goto exit;
	}
   
    /**************AES-CBC*************/
	bflb_crypt_init(&crypt_handle, BFLB_CRYPT_TYPE_AES_CBC);
    bflb_crypt_setkey(&crypt_handle, key, get_key_type(key_bytelen), key_bytelen, cbc_iv, 16, BFLB_CRYPT_DIR_ENCRYPT);
    if(bflb_crypt_encrypt(&crypt_handle, b_input, cbc_length, 0, b_output) != BFLB_CRYPT_OK)
	{
		ret = -1;
		goto exit;
	}

	/**************AES-CTR*************/
	get_ctr_iv(ctr_iv, iv, iv_len);

	get_ctr_enc_input(length, input, b_input, b_output, cbc_length/16);

	ctr_length = get_ctr_input_output_size(length);
	BL602_MemSet(b_output, 0, b_output_size);
	
    bflb_crypt_init(&crypt_handle, BFLB_CRYPT_TYPE_AES_CTR);
	bflb_crypt_setkey(&crypt_handle, key, get_key_type(key_bytelen), key_bytelen, ctr_iv, 16, BFLB_CRYPT_DIR_ENCRYPT);
	if(bflb_crypt_encrypt(&crypt_handle, b_input, ctr_length, 0, b_output) != BFLB_CRYPT_OK)
	{
	    ret = -1;
		goto exit;
	}
	

	/*first output block is tag info*/
	BL602_MemCpy_Fast(tag, b_output, tag_len);

	/*second ~ ? output block is pt info*/
	BL602_MemCpy_Fast(output, b_output + 16, length);

exit:
	 if(b_input)
		 vPortFree(b_input);
	 if(b_output)
		 vPortFree(b_output);	
	 return ret;

}

 int bl_sec_ccm_auth_decrypt(const uint8_t *key, unsigned int key_bytelen, size_t length,const unsigned char *iv, size_t iv_len, const unsigned char *add,
							 size_t add_len, const unsigned char *input, unsigned char *output, const unsigned char *tag, size_t tag_len)
 {
    unsigned char cbc_mac[16] = {0};
    unsigned char cbc_iv[16] = {0};
    unsigned char ctr_iv[16] = {0};
    unsigned int cbc_length = 0;
	unsigned int ctr_length = 0;
    unsigned int b_input_size = 0;
    unsigned int b_output_size = 0;
    unsigned char *b_input  = NULL;
    unsigned char *b_output = NULL;
    int ret = 0;

    // TODO check input arguments
    //get the max size for b_input_size between cbc and ctr,max size is the value of cbc's input size
    cbc_length = get_cbc_mac_input_size(length, add_len);
    b_input_size = cbc_length;
	//Allocate memory for input block, one block size is 16 bytes.
	b_input = pvPortMalloc(b_input_size);

	if(!b_input)
	{
	    ret = -1;
		goto exit;
	}

    ctr_length = get_ctr_input_output_size(length);
    //get the max size for b_output_size between cbc and ctr, max size is the value of ctr's output size
    // reserve enough space for CBC
    b_output_size = cbc_length;
	b_output = pvPortMalloc(b_output_size);

	if(!b_output)
	{
	    ret = -1;
		goto exit;
	}

	 BL602_MemSet(b_input, 0, b_input_size);
	 
	 BL602_MemSet(b_output, 0, b_output_size);
	
	 /* ctr part*/
	 get_ctr_iv(ctr_iv, iv, iv_len);
 
	 get_ctr_dec_input(length, input, tag, tag_len, b_input);
	 
	 bflb_crypt_init(&crypt_handle, BFLB_CRYPT_TYPE_AES_CTR);
	 bflb_crypt_setkey(&crypt_handle, key, get_key_type(key_bytelen), key_bytelen, ctr_iv, 16, BFLB_CRYPT_DIR_ENCRYPT);
  	 if(bflb_crypt_encrypt(&crypt_handle, b_input, ctr_length, 0, b_output) != BFLB_CRYPT_OK)
  	 {
		 ret = -1;
		 goto exit;
	 }
	
	 /* Copy CBC-MAC here */
	 BL602_MemCpy_Fast(cbc_mac, b_output, tag_len);
 
	 /* Copy plaintext here */
	 BL602_MemCpy_Fast(output, b_output + 16, length);
 
	 /* CBC-MAC part*/
 
	 ret = get_cbc_mac_input(length, iv, iv_len, add, add_len, output, tag_len, b_input);
 
	 if(ret)
	 {
		 ret = -1;
		 goto exit;
	 }
	
	 BL602_MemSet(b_output, 0, b_output_size);

	 /**************AES-CBC*************/
	 bflb_crypt_init(&crypt_handle, BFLB_CRYPT_TYPE_AES_CBC);
	 bflb_crypt_setkey(&crypt_handle, key, get_key_type(key_bytelen), key_bytelen, cbc_iv, 16, BFLB_CRYPT_DIR_ENCRYPT);
	 if(bflb_crypt_encrypt(&crypt_handle, b_input, cbc_length, 0, b_output) != BFLB_CRYPT_OK)
	 {
		 ret = -1;
		 goto exit;
	 }

	 /* Check CBC-MAC */
	 if (BL602_MemCmp(cbc_mac, b_output + (cbc_length/16 - 1) * 16, tag_len) != 0)
	 {
		 ret = -1;
		 goto exit;
	 }

exit:
	 if(b_input)
	     vPortFree(b_input);
	 if(b_output)
	     vPortFree(b_output);	
     return ret;
 }

int bl_sec_aes_ecb_encrypt(const uint8_t *key, unsigned int key_bytelen, size_t length, const unsigned char *input, unsigned char *output)
{
     uint8_t decrypt_iv[16]={0};
     bflb_crypt_init(&crypt_handle, BFLB_CRYPT_TYPE_AES_ECB);
     bflb_crypt_setkey(&crypt_handle, key, get_key_type(key_bytelen), key_bytelen, decrypt_iv, 16, BFLB_CRYPT_DIR_ENCRYPT);
    
     if(bflb_crypt_encrypt(&crypt_handle, input, length, 0, output) != BFLB_CRYPT_OK)
         return -1;
     return 0;
}

int bl_sec_aes_ecb_decrypt(const uint8_t *key, unsigned int key_bytelen, size_t length, const unsigned char *input, unsigned char *output)
{
     uint8_t decrypt_iv[16]={0};
     bflb_crypt_init(&crypt_handle, BFLB_CRYPT_TYPE_AES_ECB);
     bflb_crypt_setkey(&crypt_handle, key, get_key_type(key_bytelen), key_bytelen, decrypt_iv, 16, BFLB_CRYPT_DIR_DECRYPT);
    
     if(bflb_crypt_encrypt(&crypt_handle, input, length, 0, output) != BFLB_CRYPT_OK)
         return -1;
     return 0;
}

